tests-reports/stress/local-database.txt
> npx autocannon -c 500 -d 10 -w 15 --renderStatusCodes --latency localhost:3000/characters

Running 10s test @ http://localhost:3000/characters
500 connections
15 workers

-
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 394 ms │ 610 ms │ 2646 ms │ 6688 ms │ 765.64 ms │ 902.16 ms │ 9843 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 63      │ 63      │ 127     │ 181     │ 129,31  │ 30,97  │ 63      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 2.02 MB │ 2.02 MB │ 4.08 MB │ 5.82 MB │ 4.15 MB │ 995 kB │ 2.02 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 1293  │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 150

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 335          │
├────────────┼──────────────┤
│ 0.01       │ 335          │
├────────────┼──────────────┤
│ 0.1        │ 339          │
├────────────┼──────────────┤
│ 1          │ 391          │
├────────────┼──────────────┤
│ 2.5        │ 394          │
├────────────┼──────────────┤
│ 10         │ 411          │
├────────────┼──────────────┤
│ 25         │ 487          │
├────────────┼──────────────┤
│ 50         │ 610          │
├────────────┼──────────────┤
│ 75         │ 785          │
├────────────┼──────────────┤
│ 90         │ 887          │
├────────────┼──────────────┤
│ 97.5       │ 2646         │
├────────────┼──────────────┤
│ 99         │ 6688         │
├────────────┼──────────────┤
│ 99.9       │ 9704         │
├────────────┼──────────────┤
│ 99.99      │ 9843         │
├────────────┼──────────────┤
│ 99.999     │ 9843         │
└────────────┴──────────────┘

2k requests in 10.13s, 41.5 MB read
377 errors (377 timeouts)