tests-reports/stress/production-database.txt
> desafio-marvel@1.0.0 test-stress
> npx autocannon -c 500 -d 10 -w 15 --renderStatusCodes --latency localhost:3000/characters

Running 10s test @ http://localhost:3000/characters
500 connections
15 workers

/
┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬────────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼────────────┼─────────┤
│ Latency │ 834 ms │ 7392 ms │ 9975 ms │ 9990 ms │ 6753.06 ms │ 2948.85 ms │ 9995 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴────────────┴─────────┘
┌───────────┬─────┬──────┬────────┬────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%    │ 97.5%  │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼────────┼────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 27     │ 171    │ 46,2    │ 50,18   │ 1       │
├───────────┼─────┼──────┼────────┼────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 868 kB │ 5.5 MB │ 1.48 MB │ 1.61 MB │ 32.1 kB │
└───────────┴─────┴──────┴────────┴────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 462   │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 150

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 695          │
├────────────┼──────────────┤
│ 0.01       │ 695          │
├────────────┼──────────────┤
│ 0.1        │ 695          │
├────────────┼──────────────┤
│ 1          │ 733          │
├────────────┼──────────────┤
│ 2.5        │ 834          │
├────────────┼──────────────┤
│ 10         │ 1505         │
├────────────┼──────────────┤
│ 25         │ 4122         │
├────────────┼──────────────┤
│ 50         │ 7392         │
├────────────┼──────────────┤
│ 75         │ 9163         │
├────────────┼──────────────┤
│ 90         │ 9907         │
├────────────┼──────────────┤
│ 97.5       │ 9975         │
├────────────┼──────────────┤
│ 99         │ 9990         │
├────────────┼──────────────┤
│ 99.9       │ 9995         │
├────────────┼──────────────┤
│ 99.99      │ 9995         │
├────────────┼──────────────┤
│ 99.999     │ 9995         │
└────────────┴──────────────┘

1k requests in 10.19s, 14.8 MB read
90 errors (90 timeouts)